posts/your-imagination.org
#+LATEX_HEADER: \usepackage[margin=0.5in]{geometry}
#+OPTIONS: toc:nil

#+HUGO_BASE_DIR: /home/shane/var/smulliga/source/git/semiosis/semiosis-hugo
#+HUGO_SECTION: ./posts

#+TITLE: Your Imagination
#+DATE: <2021-09-12>
#+AUTHOR: Shane Mulligan
#+KEYWORDS: allegory faith music

** 1 Kings 19:11-13
*** God’s Revelation to Elijah
#+BEGIN_SRC text -n :async :results verbatim code
  11 Then He said, “Go out, and stand on the
  mountain before the Lord.” And behold, the
  Lord passed by, and a great and strong wind
  tore into the mountains and broke the rocks in
  pieces before the Lord, but the Lord was not
  in the wind; and after the wind an earthquake,
  but the Lord was not in the earthquake; 12 and
  after the earthquake a fire, but the Lord was
  not in the fire; and after the fire [a]a still
  small voice.
  
  13 So it was, when Elijah heard it, that he
  wrapped his face in his mantle and went out
  and stood in the entrance of the cave.
  Suddenly a voice came to him, and said, “What
  are you doing here, Elijah?”
#+END_SRC

** Humanity Chapter II
+ Buy the album https://www.thomasbergersen.com/album/humanity/chapter-ii/

+ The song :: [[https://www.youtube.com/watch?v=qXI5LgkcEpI][Thomas Bergersen - Your Imagination {Feat. Audrey Karrasch} - YouTube]]

#+BEGIN_SRC text -n :async :results verbatim code
  Hold my hand
  And let go of the lie
  Hold your heart
  Lost in time
  
  And when you're down for the count
  And you lost all your will to go on
  On your own
  I will fall from the sky
  Wipe the tears from your eyes
  And remind you you're never alone
  
  I am rivers and forests
  I'm winds and I'm earth
  I am oceans and mountains
  A whisper unheard
  And before you lies everything you'd ever want
  I am your, your imagination
  
  Take this chance
  And let go of the lie
  One bright feat
  One time to shine
  
  And when you're down for the count
  And you lost all your will to survive
  On your own
  I will fall from the sky
  Wipe the tears from your eyes
  And remind you you're never alone
  
  I am rivers and forests
  I'm winds and I'm earth
  I am oceans and mountains
  A whisper unheard
  And before you lies everything you'd ever want
  I am your, your imagination
  
  I am rivers and forests
  I'm winds and I'm earth
  I am oceans and mountains
  A whisper unheard
  And before you lies everything you'd ever want
  I am your, your imagination
#+END_SRC